In [1]:
import numpy as np
import pandas as pd

In [27]:
data_list = [
    ['John', 25, 'NYC', 90000],
    ['Andre', 30, 'LA', 80000],
    ['Shaw', 35, 'PAris', 70000],
    ['Araow', 40, 'Pune', 10000],
    ['Gharow', 45, 'PCMC', 20000],
    ['Samar', 50, 'Delhi', 30000],
    ['raghu', 53, 'Goa', 40000],
    ['Shinu', 58, 'Bombay', 50000]
]
df = pd.DataFrame(data_list)
col_name = ['Name', 'Age', 'City', 'Salary']
df2 = pd.DataFrame(data_list, columns=col_name)
df2

     Name  Age    City  Salary
0    John   25     NYC   90000
1   Andre   30      LA   80000
2    Shaw   35   PAris   70000
3   Araow   40    Pune   10000
4  Gharow   45    PCMC   20000
5   Samar   50   Delhi   30000
6   raghu   53     Goa   40000
7   Shinu   58  Bombay   50000

In [28]:
# df2.drop(["Age", "City"], axis=1)
df2.drop(0, axis=0)

     Name  Age    City  Salary
1   Andre   30      LA   80000
2    Shaw   35   PAris   70000
3   Araow   40    Pune   10000
4  Gharow   45    PCMC   20000
5   Samar   50   Delhi   30000
6   raghu   53     Goa   40000
7   Shinu   58  Bombay   50000

In [29]:
df2

     Name  Age    City  Salary
0    John   25     NYC   90000
1   Andre   30      LA   80000
2    Shaw   35   PAris   70000
3   Araow   40    Pune   10000
4  Gharow   45    PCMC   20000
5   Samar   50   Delhi   30000
6   raghu   53     Goa   40000
7   Shinu   58  Bombay   50000

In [31]:
# df2.loc[[0]]
df2.loc[[3,4]]

     Name  Age  City  Salary
3   Araow   40  Pune   10000
4  Gharow   45  PCMC   20000

In [32]:
df2.iloc[[2]]

   Name  Age   City  Salary
2  Shaw   35  PAris   70000

In [33]:
# df2.loc[[0,1]][["City", "Salary"]]
df2.loc[[1,2]][["Name", "Age"]]

    Name  Age
1  Andre   30
2   Shaw   35

In [35]:
df2[df2["Age"] < 40]

    Name  Age   City  Salary
0   John   25    NYC   90000
1  Andre   30     LA   80000
2   Shaw   35  PAris   70000

In [36]:
df2[(df2["Age"] > 40) & (df2["City"] == "PCMC")]

     Name  Age  City  Salary
4  Gharow   45  PCMC   20000